DataProcessors/бит_ЗакрытиеМесяцаЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗакрытиеМесяцаЖКХ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводПоказанийПодкрутки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисленияПоЛьготам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисленияПоНормам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачисленияПоСчетчикам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьОбщедомовыеНачисления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьРаспределениеАванса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРаспределенияРасходовНаОказаниеУслуг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоформитьПроживающих</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетСобственныхУслугПоНалоговомуИБухгалтерскомуУчету</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьСчетФактураВыданный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьСчетНаОплату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьОбщедомовыеНачисленияОмск</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнитьНачислениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииУслуги</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СчетчикиНаУслугахОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СчетчикиНаУслугахОбщий</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипСчетчика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Многотарифный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоУстановкиСчетчика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Комнаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет общедомового счетчика</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьСтавкуПоСчетчику</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетчикСЗависимымиУслугами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнаяУслуга</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИспользоватьПравилоУменьшения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРаспределенияУменьшения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРаспределения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ТипСчетчика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипСчетчика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Групповой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Индивидуальный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ВидыОперацииВводПоказанийПоСчетчикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацииВводПоказанийПоСчетчикам</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоказанияПодкрутки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/бит_ЗакрытиеМесяцаЖКХ/Ext/ObjectModule.bsl
#Область ПеременныеМодуля

Перем мРасчетДолей                        Экспорт; // Хранит Флаг настройки параметров ЖКХ.
Перем мУменьшитьНормуЛьготы               Экспорт; // Хранит Флаг настройки параметров ЖКХ.
Перем мУчетДнейПРоживания                 Экспорт; // Хранит Флаг настройки параметров ЖКХ.
Перем мОбщедомовыеРасходыВГрафеНачисления Экспорт; // Хранит Флаг настройки параметров ЖКХ.
Перем мСчетчикиПодкрутка                  Экспорт; // Хранит Флаг настройки параметров ЖКХ.
Перем мЛьготаПерсонифицированная          Экспорт; // Хранит Флаг настройки параметров ЖКХ.

Перем мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика Экспорт; // Хранит Флаг настройки параметров ЖКХ.

Перем мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика Экспорт; // Хранит Флаг настройки параметров ЖКХ.

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

Процедура ПереоформлениеПроживающих(Индикатор,НадписьНачисление)
	
	НадписьНачисление.Заголовок = "Переоформление проживающих по лс.";
	
	ЗапросПроживающихПоЛС = Новый Запрос;
	ЗапросПроживающихПоЛС.Текст =
	"ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаЗаписи КАК ДатаЗаписи,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ПричинаВыписки,
	|	бит_ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации <> ДАТАВРЕМЯ(1, 1, 1)
	|	И бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	бит_ПроживающиеПоЛССрезПоследних.ЛицевойСчет,
	|	бит_ПроживающиеПоЛССрезПоследних.ФизЛицо,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица,
	|	бит_ПроживающиеПоЛССрезПоследних.СтепеньРодства,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусПроживания,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаЗаписи,
	|	бит_ПроживающиеПоЛССрезПоследних.ВладелецКвартиры,
	|	бит_ПроживающиеПоЛССрезПоследних.ПричинаВыписки,
	|	бит_ПроживающиеПоЛССрезПоследних.КудаВыписан,
	|	бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Дата, ) КАК бит_ПроживающиеПоЛССрезПоследних
	|ГДЕ
	|	бит_ПроживающиеПоЛССрезПоследних.ДатаЗаписи <> ДАТАВРЕМЯ(1, 1, 1)
	|	И бит_ПроживающиеПоЛССрезПоследних.ДатаЗаписи < КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И бит_ПроживающиеПоЛССрезПоследних.СтатусФизЛица <> ЗНАЧЕНИЕ(Справочник.бит_СтатусФизЛица.Выписан)
	|ИТОГИ ПО
	|	ЛицевойСчет";
	
	ЗапросПроживающихПоЛС.УстановитьПараметр("Дата", КонецМесяца(ДатаЗакрытия));
	
	ВыборкаЛС = ЗапросПроживающихПоЛС.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Индикатор.МаксимальноеЗначение = ВыборкаЛС.Количество(); 
	Индикатор.Значение = 0;
	Индикатор.ОтображатьПроценты = Истина;
	
	Пока ВыборкаЛС.Следующий() Цикл
		
		ДокументРПЛ = Неопределено;
		
		Выборка = ВыборкаЛС.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ДокументРПЛ = Неопределено Тогда
				
				ДокументРПЛ = Документы.бит_РегистрацияПроживающихПоЛС.СоздатьДокумент();
				
				ДокументРПЛ.Дата          = КонецДня(ДатаЗакрытия) - 2;
				ДокументРПЛ.ЛицевойСчет   = ВыборкаЛС.ЛицевойСчет;
				ДокументРПЛ.Комментарий   = "Документ создан автоматически при закрытии месяца " + Формат(ДатаЗакрытия, "ДФ='ММММ гггг'");
				ДокументРПЛ.Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
				
			КонецЕсли;
			
			НоваяСтрока = ДокументРПЛ.СписокПроживающих.Добавить();
			
			НоваяСтрока.ФизЛицо                = Выборка.ФизЛицо;
			НоваяСтрока.ДатаРегистрации        = Выборка.ДатаРегистрации;
			НоваяСтрока.ДатаСнятияСРегистрации = Выборка.ДатаСнятияСРегистрации;
			НоваяСтрока.СтатусПроживания       = Выборка.СтатусПроживания;
			НоваяСтрока.СтепеньРодства         = Выборка.СтепеньРодства;
			
			Если ЗначениеЗаполнено(Выборка.ДатаЗаписи) Тогда
				
				НоваяСтрока.СтатусФизЛица = Выборка.СтатусФизЛицаДляИзменения;
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.ДатаСнятияСРегистрации) Тогда
				
				НоваяСтрока.СтатусФизЛица  = Справочники.бит_СтатусФизЛица.Выписан;
				НоваяСтрока.ПричинаВыписки = Справочники.бит_ПричиныВыписки.ОкончаниеВремениРегистрации;
				
			КонецЕсли;  
			
			
		КонецЦикла; 
		
		Если НЕ ДокументРПЛ = Неопределено И ДокументРПЛ.СписокПроживающих.Количество() > 0 Тогда // БИТ_ЖКХ 23.11.2010 18:18:32
			
			Попытка
				
				ДокументРПЛ.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли; 
		
		Индикатор.Значение = Индикатор.Значение + 1;
		
	КонецЦикла; 
	
КонецПроцедуры

Процедура ВводПоказанийПодкрутки(Индикатор,НадписьНачисление)
	
	НадписьНачисление.Заголовок = "Ввод показаний подркутки по счетчикам.";
	
	ЗапросВводПоказаний = Новый Запрос;
	ЗапросВводПоказаний.Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.Ссылка КАК ЛицевойСчет,
	|	ВложенныйЗапрос.Счетчик,
	|	ВложенныйЗапрос.Здание КАК Здание,
	|	ВложенныйЗапрос.Улица,
	|	ВЫБОР
	|		КОГДА ВложенныйЗапрос.ПоказанияИнспектора <> 0
	|				ИЛИ ВложенныйЗапрос.ПоказанияНаселения <> 0
	|				ИЛИ ВложенныйЗапрос.ПоказанияПодкрутка <> 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Удалить
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЛицевыеСчета.Ссылка КАК Ссылка,
	|		ЛицевыеСчета.Счетчик КАК Счетчик,
	|		ЛицевыеСчета.Здание КАК Здание,
	|		ЛицевыеСчета.Улица КАК Улица,
	|		ВЫБОР
	|			КОГДА бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_ВводПоказанийПоСчетчикам
	|					ИЛИ бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_УстановкаСчетчика
	|				ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияИнспектораПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПоказанияИнспектора,
	|		ВЫБОР
	|			КОГДА бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_ВводПоказанийПоСчетчикам
	|					ИЛИ бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_УстановкаСчетчика
	|				ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОбороты.ТекущиеПоказанияНаселенияПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПоказанияНаселения,
	|		ВЫБОР
	|			КОГДА бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_ВводПоказанийПоСчетчикам
	|					ИЛИ бит_ПоказанияСчетчиковОбороты.Регистратор ССЫЛКА Документ.бит_УстановкаСчетчика
	|				ТОГДА ЕСТЬNULL(бит_ПоказанияСчетчиковОбороты.ПоказанияПодкруткаПриход, 0)
	|			ИНАЧЕ 0
	|		КОНЕЦ КАК ПоказанияПодкрутка
	|	ИЗ
	|		(ВЫБРАТЬ
	|			бит_ЛицевыеСчета.Ссылка КАК Ссылка,
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик КАК Счетчик,
	|			бит_ЛицевыеСчета.Здание КАК Здание,
	|			бит_ЛицевыеСчета.УлицаЛицевогоСчета КАК Улица
	|		ИЗ
	|			Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
	|				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СчетчикиНаУслугахОбщий.СрезПоследних(&КонецПериода, ТипСчетчика = ЗНАЧЕНИЕ(Перечисление.бит_ТипСчетчика.Индивидуальный)) КАК бит_СчетчикиНаУслугахОбщийСрезПоследних
	|				ПО бит_ЛицевыеСчета.Ссылка = бит_СчетчикиНаУслугахОбщийСрезПоследних.Объект
	|		ГДЕ
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Использовать
	|			И бит_ЛицевыеСчета.Организация = &Организация
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_СчетчикиНаУслугахОбщийСрезПоследних.Счетчик,
	|			бит_ЛицевыеСчета.Ссылка,
	|			бит_ЛицевыеСчета.Здание,
	|			бит_ЛицевыеСчета.УлицаЛицевогоСчета) КАК ЛицевыеСчета
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ПоказанияСчетчиков.Обороты(&НачалоПериода, &КонецПериода, Регистратор, ) КАК бит_ПоказанияСчетчиковОбороты
	|			ПО ЛицевыеСчета.Ссылка = бит_ПоказанияСчетчиковОбороты.Объект
	|				И ЛицевыеСчета.Счетчик = бит_ПоказанияСчетчиковОбороты.Счетчик) КАК ВложенныйЗапрос
	|ИТОГИ ПО
	|	Здание";
	
	ЗапросВводПоказаний.УстановитьПараметр("Началопериода"     , НачалоМесяца(ДатаЗакрытия));
	ЗапросВводПоказаний.УстановитьПараметр("КонецПериода"      , КонецМесяца(ДатаЗакрытия));
	ЗапросВводПоказаний.УстановитьПараметр("Организация"       , Организация);
	
	ВыборкаЗдание = ЗапросВводПоказаний.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Индикатор.МаксимальноеЗначение = ВыборкаЗдание.Количество(); 
	Индикатор.Значение = 0;
	Индикатор.ОтображатьПроценты = Истина;
	
	Пока ВыборкаЗдание.Следующий() Цикл
		
		ДокументВводПоказаний = Документы.бит_ВводПоказанийПоСчетчикам.СоздатьДокумент();
		
		ДокументВводПоказаний.Дата        = КонецДня(ДатаЗакрытия) - 2;
		ДокументВводПоказаний.Организация = Организация;
		ДокументВводПоказаний.ВидОперации = Перечисления.бит_ВидыОперацииВводПоказанийПоСчетчикам.ПоказанияПодкрутки;
		ДокументВводПоказаний.ТипСчетчика = Перечисления.бит_ТипСчетчика.Индивидуальный;
		ДокументВводПоказаний.Улица       = ВыборкаЗдание.Здание.Улица;
		ДокументВводПоказаний.Дом         = ВыборкаЗдание.Здание;
		#Если Клиент Тогда
			ДокументВводПоказаний.Комментарий = "Документ создан автоматически при закрытии месяца " + Формат(ДатаЗакрытия, "ДФ='ММММ гггг'");
		#КонецЕсли
		ДокументВводПоказаний.ЗаполнитьТаблицуПоказаний();
		
		Отбор = Новый Структура;
		
		Выборка = ВыборкаЗдание.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Отбор.Очистить();
			Отбор.Вставить("ЛицевойСчет",Выборка.ЛицевойСчет); 
			Отбор.Вставить("Счетчик"    ,Выборка.Счетчик);
			
			МассивСтрок =  ДокументВводПоказаний.ПоказанияПоСчетчикам.НайтиСтроки(Отбор);
			
			Для каждого Строка Из МассивСтрок Цикл
				Если Выборка.Удалить Тогда
					
					ДокументВводПоказаний.ПоказанияПоСчетчикам.Удалить(Строка);
					
				КонецЕсли; 
			КонецЦикла; 
			
		КонецЦикла; 
		
		// БИТ_ЖКХ 25.07.2014
		// Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 1 Тогда.
		Если ДокументВводПоказаний.ПоказанияПоСчетчикам.Количество() > 0 Тогда
			// БИТ_ЖКХ 25.07.2014
			
			Попытка
				
				ДокументВводПоказаний.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
		Индикатор.Значение = Индикатор.Значение + 1;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполлнитьНачисленияПоКУ(Индикатор,НадписьНачисление)Экспорт
	
	ДатаТекст = Формат(ДатаЗакрытия, "ДФ='ММММ гггг'");
	
	Ответственный = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	Если ПереоформитьПроживающих Тогда
		
		ПереоформлениеПроживающих(Индикатор,НадписьНачисление);
		
	КонецЕсли; 
	
	ОбновитьПараметрыЖКХ();
	
	Если мСчетчикиПодкрутка И ВводПоказанийПодкрутки Тогда
		
		ВводПоказанийПодкрутки(Индикатор,НадписьНачисление);
		
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , КонецМесяца(ДатаЗакрытия));
	
	Если ВыполнитьНачисления Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СписокЗданий.Ссылка КАК Здание,
		|	бит_СписокЗданий.Улица,
		|	ЕСТЬNULL(НачислениеПоЛС.ДокументНачисления, ЗНАЧЕНИЕ(Документ.бит_НачислениеПоЛицевымСчетам.ПустаяССылка)) КАК ДокументНачисления,
		|	ЕСТЬNULL(НачисленияПоСчетчикам.ДокументПоСч, ЗНАЧЕНИЕ(Документ.бит_НачисленияПоСчетчикам.ПустаяСсылка)) КАК ДокументПоСч,
		|	ЕСТЬNULL(НачисленияПоЛьготам.ДокументПоЛьготам, ЗНАЧЕНИЕ(Документ.бит_НачислениеЛьготПоЛицевымСчетам.ПустаяСсылка)) КАК ДокументПоЛьготам
		|ИЗ
		|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			бит_НачислениеПоЛицевымСчетам.Ссылка КАК ДокументНачисления,
		|			бит_НачислениеПоЛицевымСчетам.Здание КАК Здание
		|		ИЗ
		|			Документ.бит_НачислениеПоЛицевымСчетам КАК бит_НачислениеПоЛицевымСчетам
		|		ГДЕ
		|			бит_НачислениеПоЛицевымСчетам.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПоЛицевымСчетам.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И бит_НачислениеПоЛицевымСчетам.Организация = &Организация) КАК НачислениеПоЛС
		|		ПО бит_СписокЗданий.Ссылка = НачислениеПоЛС.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НачисленияПоСчетчикам.Ссылка КАК ДокументПоСч,
		|			НачисленияПоСчетчикам.Здание КАК Здание
		|		ИЗ
		|			Документ.бит_НачисленияПоСчетчикам КАК НачисленияПоСчетчикам
		|		ГДЕ
		|			НачисленияПоСчетчикам.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|			И НачисленияПоСчетчикам.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И НачисленияПоСчетчикам.Организация = &Организация) КАК НачисленияПоСчетчикам
		|		ПО бит_СписокЗданий.Ссылка = НачисленияПоСчетчикам.Здание
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			НачислениеЛьготПоЛС.Ссылка КАК ДокументПоЛьготам,
		|			НачислениеЛьготПоЛС.Здание КАК Здание
		|		ИЗ
		|			Документ.бит_НачислениеЛьготПоЛицевымСчетам КАК НачислениеЛьготПоЛС
		|		ГДЕ
		|			НачислениеЛьготПоЛС.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|			И НачислениеЛьготПоЛС.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|			И НачислениеЛьготПоЛС.Организация = &Организация) КАК НачисленияПоЛьготам
		|		ПО бит_СписокЗданий.Ссылка = НачисленияПоЛьготам.Здание
		|ГДЕ
		|	бит_СписокЗданий.Организация = &Организация";
		
		ТекстЛС = 
		"ВЫБРАТЬ
		|	бит_ЛицевыеСчета.Ссылка КАК ЛицевойСчет
		|ИЗ
		|	Справочник.бит_ЛицевыеСчета КАК бит_ЛицевыеСчета
		|ГДЕ
		|	бит_ЛицевыеСчета.Организация = &Организация
		|	И бит_ЛицевыеСчета.Здание = &Здание
		|	И бит_ЛицевыеСчета.УлицаЛицевогоСчета = &Улица";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Индикатор.МаксимальноеЗначение = Выборка.Количество(); 
		Индикатор.Значение = 0;
		Индикатор.ОтображатьПроценты = Истина;
		
		СнятьПометкуНаУдаление = Ложь;
		ЗадатьВопрос           = Истина;
		
		Пока Выборка.Следующий() Цикл
			
			Запрос.Текст = ТекстЛС;
			
			Запрос.УстановитьПараметр("Здание", Выборка.Здание);
			Запрос.УстановитьПараметр("Улица" , Выборка.Улица);
			
			Результат = Запрос.Выполнить().Выгрузить();
			
			Если Результат.Количество() = 0 Тогда
				
				Индикатор.МаксимальноеЗначение = Индикатор.МаксимальноеЗначение - 1;
				Продолжить;
				
			КонецЕсли;
			
			
			НадписьНачисление.Заголовок = "Начисление по адресу : ул. "+ Выборка.Улица+" д. "+Выборка.Здание;
			
			СписокЗданий = Новый Массив;
			СписокЛС     = Новый Массив;
			
			СписокЗданий.Добавить(Выборка.Здание);
			
			СписокЛС = Результат.ВыгрузитьКолонку("ЛицевойСчет");
			
			ТаблицаНачислений = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуНачислений();
			ТаблицаСчетчиков  = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуСчетчиков();
			ТаблицаРаспред    = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуРаспредилений();
			ТаблицаЛьгот      = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуЛьгот();
			ТаблицаПрожив     = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуПроживающих();
			
			бит_РасчетыПоКоммунальнымУслугам.ВыполнитьНачисления(КонецМесяца(ДатаЗакрытия), 
			Организация, 
			СписокЛС, 
			СписокЗданий, 
			, 
			, 
			ТаблицаНачислений, 
			ТаблицаСчетчиков, 
			ТаблицаРаспред, 
			ТаблицаЛьгот,
			,
			,
			мРасчетДолей,
			мУменьшитьНормуЛьготы, 
			мУчетДнейПРоживания, 
			ТаблицаПрожив, 
			,
			мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика,
			мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика);
			
			Если ВыполнитьНачисленияПоНормам Тогда
				
				Если ЗначениеЗаполнено(Выборка.ДокументНачисления) Тогда
					
					ДокументНачисленийПоЛС = Выборка.ДокументНачисления.ПолучитьОбъект();
					
					Если ДокументНачисленийПоЛС.ПометкаУдаления Тогда
						
						ДокументНачисленийПоЛС.УстановитьПометкуУдаления(Ложь);
						
					КонецЕсли; 
					
					ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
					ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					
				Иначе
					
					ДокументНачисленийПоЛС = Документы.бит_НачислениеПоЛицевымСчетам.СоздатьДокумент();
					
					ДокументНачисленийПоЛС.Дата        = КонецМесяца(ДатаЗакрытия) - 5;
					ДокументНачисленийПоЛС.Организация = Организация;
					ДокументНачисленийПоЛС.Улица       = Выборка.Улица;
					ДокументНачисленийПоЛС.Здание      = Выборка.Здание;
					
					ДокументНачисленийПоЛС.Ответственный = Ответственный;
					ДокументНачисленийПоЛС.Комментарий   = "Документ создан автоматически при закрытии месяца " + ДатаТекст;
					
				КонецЕсли;
				
				// Начисление по лицевым счетам.
				Если ТаблицаНачислений.Количество() > 0 Тогда
					
					бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаНачислений);
					ДокументНачисленийПоЛС.ЗаполнениеСчетовКУ(ТаблицаНачислений);
					
					ДокументНачисленийПоЛС.ЛицевыеСчета.Очистить();
					ДокументНачисленийПоЛС.ЛицевыеСчета.Загрузить(ТаблицаНачислений);
					
					ДокументНачисленийПоЛС.НачисленияПоПроживающим.Очистить();
					ДокументНачисленийПоЛС.НачисленияПоПроживающим.Загрузить(ТаблицаПрожив);
					
					ДокументНачисленийПоЛС.мРасчетСУчетомДолейВладения          = мРасчетДолей;
					ДокументНачисленийПоЛС.мУменьшениеНормыЛьготыВПределахФакта = мУменьшитьНормуЛьготы;
					
					Попытка
						
						Если ДокументНачисленийПоЛС.ЛицевыеСчета.Количество() > 0 Тогда
							
							ДокументНачисленийПоЛС.Записать(РежимЗаписиДокумента.Проведение);
							
						КонецЕсли; 
						
					Исключение

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
						
					КонецПопытки; 
					
				КонецЕсли;
			КонецЕсли;
			
			Если ВыполнитьНачисленияПоСчетчикам Тогда
				
				Если ЗначениеЗаполнено(Выборка.ДокументПоСч) Тогда
					
					ДокументНачисленийПоСЧ = Выборка.ДокументПоСч.ПолучитьОбъект();
					
					Если ДокументНачисленийПоСЧ.ПометкаУдаления Тогда
						
						ДокументНачисленийПоСЧ.УстановитьПометкуУдаления(Ложь);
						
					КонецЕсли;
					
					ДокументНачисленийПоСЧ.Начисления.Очистить();
					ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					
				Иначе
					ДокументНачисленийПоСЧ = Документы.бит_НачисленияПоСчетчикам.СоздатьДокумент();
					
					ДокументНачисленийПоСЧ.Дата        = КонецМесяца(ДатаЗакрытия) - 8;
					ДокументНачисленийПоСЧ.Организация = Организация;
					ДокументНачисленийПоСЧ.Улица       = Выборка.Улица;
					ДокументНачисленийПоСЧ.Здание      = Выборка.Здание;
					
					ДокументНачисленийПоСЧ.Ответственный = Ответственный;
					ДокументНачисленийПоСЧ.Комментарий   = "Документ создан автоматически при закрытии месяца " + ДатаТекст;
					
				КонецЕсли;
				
				// Начисление по счетчикам.
				Если ТаблицаСчетчиков.Количество() > 0 ИЛИ ТаблицаРаспред.Количество() > 0 Тогда
					
					бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаСчетчиков);
					ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаСчетчиков);
					ДокументНачисленийПоСЧ.Начисления.Очистить();
					ДокументНачисленийПоСЧ.Начисления.Загрузить(ТаблицаСчетчиков);
					
					бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаРаспред);
					ДокументНачисленийПоСЧ.ЗаполнениеСчетовКУ(ТаблицаРаспред);
					ДокументНачисленийПоСЧ.Распределения.Очистить();
					ДокументНачисленийПоСЧ.Распределения.Загрузить(ТаблицаРаспред);
					
					ДокументНачисленийПоСЧ.мРасчетСУчетомДолейВладения = мРасчетДолей;
					
					Попытка
						
						Если ДокументНачисленийПоСЧ.Начисления.Количество() > 0 ИЛИ ДокументНачисленийПоСЧ.Распределения.Количество() > 0 Тогда
							
							ДокументНачисленийПоСЧ.Записать(РежимЗаписиДокумента.Проведение);
							
						КонецЕсли; 
						
					Исключение

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
						
					КонецПопытки; 
					
				КонецЕсли;
			КонецЕсли;
			
			Если ВыполнитьНачисленияПоЛьготам Тогда
				
				Если ЗначениеЗаполнено(Выборка.ДокументПоЛьготам) Тогда
					
					ДокументНачисленийПоЛьготам = Выборка.ДокументПоЛьготам.ПолучитьОбъект();
					
					Если ДокументНачисленийПоЛьготам.ПометкаУдаления Тогда
						
						ДокументНачисленийПоЛьготам.УстановитьПометкуУдаления(Ложь);
						
					КонецЕсли;
					
					ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
					ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
					ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					
				Иначе
					
					ДокументНачисленийПоЛьготам = Документы.бит_НачислениеЛьготПоЛицевымСчетам.СоздатьДокумент();
					
					ДокументНачисленийПоЛьготам.Дата        = КонецМесяца(ДатаЗакрытия) - 7;
					ДокументНачисленийПоЛьготам.Организация = Организация;
					ДокументНачисленийПоЛьготам.Улица       = Выборка.Улица;
					ДокументНачисленийПоЛьготам.Здание      = Выборка.Здание;
					
					ДокументНачисленийПоЛьготам.Ответственный = Ответственный;
					ДокументНачисленийПоЛьготам.Комментарий   = "Документ создан автоматически при закрытии месяца " + ДатаТекст;
					
				КонецЕсли;
				
				// Начисление по Льготам.
				Если ТаблицаЛьгот.Количество() > 0 Тогда
					
					ДокументНачисленийПоЛьготам.СписокЛьгот.Очистить();
					ДокументНачисленийПоЛьготам.СписокЛьгот.Загрузить(ТаблицаЛьгот);
					
					ТаблицаЛьгот.Свернуть("ЛицевойСчет,Услуга,Начислено");
					
					бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаЛьгот);
					ДокументНачисленийПоЛьготам.ЗаполнениеСчетовКУ(ТаблицаЛьгот);
					ДокументНачисленийПоЛьготам.ЛицевыеСчета.Очистить();
					ДокументНачисленийПоЛьготам.ЛицевыеСчета.Загрузить(ТаблицаЛьгот);
					
					ДокументНачисленийПоЛьготам.мЛьготаПерсонифицированная           = мЛьготаПерсонифицированная;
					ДокументНачисленийПоЛьготам.мРасчетСУчетомДолейВладения          = мРасчетДолей;
					ДокументНачисленийПоЛьготам.мУменьшениеНормыЛьготыВПределахФакта = мУменьшитьНормуЛьготы;
					
					Попытка
						
						Если ДокументНачисленийПоЛьготам.ЛицевыеСчета.Количество() > 0 Тогда
							
							ДокументНачисленийПоЛьготам.Записать(РежимЗаписиДокумента.Проведение);
							
						КонецЕсли; 
						
					Исключение

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
						
					КонецПопытки; 
					
				КонецЕсли;
			КонецЕсли;
			
			Индикатор.Значение = Индикатор.Значение + 1;
		КонецЦикла; 
	КонецЕсли;
	
	Если мОбщедомовыеРасходыВГрафеНачисления И ВыполнитьОбщедомовыеНачисления Тогда
		
		НадписьНачисление.Заголовок = "Начисление общедомовых расходов.";
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Ссылка КАК Документ,
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Здание
		|ПОМЕСТИТЬ ДокОбщДом
		|ИЗ
		|	Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными КАК бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными
		|ГДЕ
		|	бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Дата >= НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ)
		|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Дата <= КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|	И бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	бит_СписокЗданий.Ссылка КАК Здание,
		|	бит_СписокЗданий.Улица,
		|	ЕСТЬNULL(ДокОбщДом.Документ, ЗНАЧЕНИЕ(Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.ПустаяССылка)) КАК Документ
		|ИЗ
		|	Справочник.бит_СписокЗданий КАК бит_СписокЗданий
		|		ЛЕВОЕ СОЕДИНЕНИЕ ДокОбщДом КАК ДокОбщДом
		|		ПО бит_СписокЗданий.Ссылка = ДокОбщДом.Здание";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДокументОбщедомовыеРасходы = Неопределено;
		
		Отбор = Новый Структура;
		
		Индикатор.МаксимальноеЗначение = Выборка.Количество(); 
		Индикатор.Значение = 0;
		Индикатор.ОтображатьПроценты = Истина;
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.Документ.Пустая() Тогда
				
				ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
				
				Если ДокументОбщедомовыеРасходы.ПометкаУдаления Тогда
					
					ДокументОбщедомовыеРасходы.УстановитьПометкуУдаления(Ложь);
					
				КонецЕсли; 
				
				ДокументОбщедомовыеРасходы.Начисления.Очистить();
				ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выборка.Сбросить();
		
		ТаблицаОбщедомовыеНачисления = бит_РасчетыПоКоммунальнымУслугам.СформироватьТаблицуОбщедомовыхРасходов();
		
		бит_РасчетыПоКоммунальнымУслугам.РасчитатьНачисленияПоОбщедомовымРасходам(ДатаЗакрытия, Организация, ТаблицаОбщедомовыеНачисления);
		
		бит_РасчетыПоКоммунальнымУслугам.ДобавитьКолонкиБухУчета(ТаблицаОбщедомовыеНачисления);
		
		СписокЛС = ТаблицаОбщедомовыеНачисления.ВыгрузитьКолонку("ЛицевойСчет");
		Колонки  = ТаблицаОбщедомовыеНачисления.Колонки;
		
		бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(ТаблицаОбщедомовыеНачисления, Колонки, СписокЛС, Организация, ДатаЗакрытия);
		
		ТаблицаОбщедомовыеНачисления.Сортировать("Приоритет ВОЗР, НаименованиеЛС ВОЗР");
		
		Пока Выборка.Следующий() Цикл
			
			Если НЕ Выборка.Документ.Пустая() Тогда
				
				ДокументОбщедомовыеРасходы = Выборка.Документ.ПолучитьОбъект();
				
			Иначе
				
				ДокументОбщедомовыеРасходы = Документы.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными.СоздатьДокумент();
				
				ДокументОбщедомовыеРасходы.Дата          = КонецМесяца(ДатаЗакрытия) - 6;
				ДокументОбщедомовыеРасходы.Улица         = Выборка.Улица;
				ДокументОбщедомовыеРасходы.Здание        = Выборка.Здание;
				ДокументОбщедомовыеРасходы.Организация   = Организация;
				ДокументОбщедомовыеРасходы.Ответственный = Ответственный;
				ДокументОбщедомовыеРасходы.Комментарий   = "Документ создан автоматически при закрытии месяца " + ДатаТекст;
				
			КонецЕсли;
			
			Отбор.Очистить();
			Отбор.Вставить("Здание", Выборка.Здание);
			
			СтрокиПоЗданию = ТаблицаОбщедомовыеНачисления.НайтиСтроки(Отбор);
			
			Если НЕ ДокументОбщедомовыеРасходы = Неопределено Тогда
				
				ДокументОбщедомовыеРасходы.Начисления.Очистить();
				
				Если СтрокиПоЗданию.Количество() > 0 Тогда
					
					Для каждого СтрокаТаблицы Из СтрокиПоЗданию Цикл
						
						НоваяСтрока = ДокументОбщедомовыеРасходы.Начисления.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы);
						
					КонецЦикла; 
					
					Попытка
						
						ДокументОбщедомовыеРасходы.Записать(РежимЗаписиДокумента.Проведение);
						
					Исключение

						бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Ошибка: " + ОписаниеОшибки());
						
					КонецПопытки; 
					
					Индикатор.Значение = Индикатор.Значение + 1;
					
				Иначе
					
					Индикатор.МаксимальноеЗначение = Индикатор.МаксимальноеЗначение - 1;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли; 
	
	НадписьНачисление.Заголовок = "Закрытие месяца выполнено.";
	
КонецПроцедуры

// Процедура обновляет настройки параметров ЖКХ из регистра актуальным значением.
//
Процедура ОбновитьПараметрыЖКХ()
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"         , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта", Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"    , Ложь);
	ПараметрыЖКХ.Вставить("ОбщедомовыеРасходыВГрафеНачисления" , Ложь);
	ПараметрыЖКХ.Вставить("СчетчикиПодкрутка"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"          , Ложь); 
	
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	// БИТ_ЖКХ_06102013_начало_изменений
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	// БИТ_ЖКХ_06102013_окончание_изменений
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецМесяца(ДатаЗакрытия), Организация, ПараметрыЖКХ);
	
	мРасчетДолей          = ПараметрыЖКХ.РасчетСУчетомДолейВладения;
	мУменьшитьНормуЛьготы = ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта;
	мУчетДнейПРоживания   = ПараметрыЖКХ.НачислениеСУчетомДнейПроживания;
	
	мОбщедомовыеРасходыВГрафеНачисления = ПараметрыЖКХ.ОбщедомовыеРасходыВГрафеНачисления;
	мСчетчикиПодкрутка                  = ПараметрыЖКХ.СчетчикиПодкрутка;
	мЛьготаПерсонифицированная          = ПараметрыЖКХ.ЛьготаПерсонифицированная;
	
	мРасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика = ПараметрыЖКХ.РасчетПоСоциальнымНормамСучетомМноготарифногоСчетчика;
	
	// БИТ_ЖКХ_06102013_начало_изменений
	мРаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика = ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика;
	// БИТ_ЖКХ_06102013_окончание_изменений
	
КонецПроцедуры // ОбновитьПараметрыЖКХ()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// БИТ_ЖКХ 14.04.2014
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.Организация) Тогда
		
		бит_ЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект ,бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь"));
		
	КонецЕсли;
	// БИТ_ЖКХ 14.04.2014
	
КонецПроцедуры

#КонецОбласти
